lab11_ci/ci4/app/Controllers/Artikel.php

SELECT *
FROM `artikel`
---
    public function index()
    {
        $title = 'Daftar Artikel';
        $model = new ArtikelModel();
        $artikel = $model->findAll();

SELECT *
FROM `artikel`
WHERE `slug` = 'artikel-pertama'
 LIMIT 1
---
    public function view($slug)
    {
        $model = new ArtikelModel();
        $artikel = $model->where([
            'slug' => $slug
        ])->first();

SELECT *
FROM `artikel`
---
    public function admin_index()
    {
        $title = 'Daftar Artikel';
        $model = new ArtikelModel();
        $artikel = $model->findAll();