lab11_ci4/ci4/app/Controllers/Artikel.php

SELECT *
FROM `artikel`
---
    public function index()
    {
        $model = new ArtikelModel();

        $data = [
            'title' => 'Daftar Artikel',
            'artikel' => $model->findAll()

SELECT *
FROM `artikel`
WHERE `slug` = 'Pertaruhan'
 LIMIT 1
---
    public function view($slug)
    {
        $model = new ArtikelModel();

        $artikel = $model->where([
            'slug' => $slug

        ])->first();

SELECT *
FROM `artikel`
---
    public function admin_index()
    {
        $title = 'Daftar Artikel';
        $model = new ArtikelModel();
        $artikel = $model->findAll();